Repository: el2zay/fileweightloss
Catalog: lib/l10n/app_*.arb
Languages: fr

# addFiles
source: or click to add files
fr: ou cliquez pour en ajouter

# brewMessage
source: Homebrew is already installed on your Mac, you can install {name} by entering the command brew install {bin} in your terminal. Wait for installation to complete, then click OK.
fr: Homebrew est déjà installé sur votre Mac, vous pouvez installer {name} en tapant la commande brew install {bin} dans votre terminal. Attendez la fin de l'installation puis cliquez sur OK.

source: Browse
fr: Parcourir

# buyMeCoffee
source: Buy me a coffee
fr: Achète-moi un café

source: Cancel
fr: Annuler

# changeCompressedName
source: Change compressed file name
fr: Modifier le nom du fichier compressé

source: Check Updates
fr: Vérifier les mises à jour

# clickAdd
source: or click to add files
fr: ou cliquez pour en ajouter

# clickNew
source: Click here to compress new files
fr: Cliquez ici pour compresser de nouveaux fichiers

# clickSelect
source: or click to select files
fr: ou cliquez pour sélectionner vos fichiers

# completed
source: Done
fr: Terminé

source: Compress
fr: Compresser

# compressedMessage
source: In total, your files are {percent}% smaller.
fr: Au total vos fichiers sont {percent}% plus légers.

source: Compressing...
fr: Compression en cours...

# compressionError
source: Error during compression - {error}.
fr: Erreur lors de la compression - {error}.

# compressionNotEffective
source: Compression not effective enough, keeping original file.
fr: La compression n'est pas assez efficace, le fichier original est conservé.

# confirmQuit
source: Are you sure you want to quit?
fr: Êtes-vous sûr de vouloir quitter ?

# convertedMessage
source: All your files have been converted to {format}.
fr: Tous vos fichiers ont été convertis en {format}.

# currentPath
source: Current {name} path
fr: Chemin actuel de {name}

source: Custom
fr: Personnalisée

source: Default output directory
fr: Dossier de sortie par défaut

source: Delete originals
fr: Supprimer les originaux

# dirPathError
source: The directory does not exist.
fr: Le dossier n'existe pas.

# doneMessage
source: Your files have been successfully {type}.
fr: Vos fichiers ont été {type} avec succès.

source: Download
fr: Télécharger

# dropFiles
source: Drop your files here
fr: Déposez vos fichiers ici

# dropNow
source: You can drop now!
fr: Vous pouvez lâcher !

# emptyPath
source: Please enter a valid path.
fr: Veuillez entrer un chemin valide.

# endError
source: An error has occurred.
fr: Une erreur s'est produite.

# endErrorDescription0
source: No files have been converted.
fr: Aucun fichier n'a été converti.

# endErrorDescription1
source: Some files could not be processed.
fr: Certains fichiers n'ont pas pu être traité.

source: Error
fr: Erreur

source: Explore
fr: Explorer

# feedback
source: Give me your feedback !
fr: Donnez-moi votre avis !

# ffmpegRequired
source: A module (ffmpeg) is required to continue. Would you like to install it? An internet connection is required for installation.
fr: Un module (ffmpeg) est nécessaire pour continuer. Voulez-vous l'installer ? Une connexion internet est requise pour l'installation.

# ffmpegTooltip
source: FFmpeg lets you compress and convert audio and video files.
fr: FFmpeg vous permet de compresser et convertir des fichiers audios et vidéos.

source: File not found after compression.
fr: Fichier introuvable après la compression.

# filePathError
source: The file does not exist.
fr: Le fichier n'existe pas.

# filesReady
source: Your files are ready!
fr: Vos fichiers sont prêts !

source: GitHub repository
fr: Dépôt GitHub

# giveFeedback
source: Give us your feedback
fr: Donnez-nous votre avis

source: Good
fr: Bonne

# gsRequired
source: GhostScript is required to compress PDFs.
fr: GhostScript est requis pour compresser des PDFs.

# gsSuccess
source: You can now compress your PDF files.
fr: Vous pouvez maintenant compresser vos fichiers PDF.

# helpUsWithAttachments
source: To help us find the cause of this error more easily, please send us the problem files as attachments.
fr: Pour nous aider à trouver plus simplement la cause de cette erreur, merci de nous envoyer les fichiers posants problèmes en pièce jointe.

source: here
fr: ici

source: High
fr: Haute

# includeFiles
source: Include files (recommended)
fr: Inclure les fichiers (recommandé)

# includeFilesDescription
source: This can help us find the error more quickly.
fr: Cela peut nous permettre de trouver l'erreur plus rapidement.

source: Install
fr: Installer

# installGs0
source: • To install GhostScript, click
fr: • Pour installer GhostScript, cliquez

# installGs1MagickWindows
source: to download the installation file. • Execute the downloaded file, then follow the instructions given by the installer • Once installation is complete, click on the 'OK' button to continue. • Installation requires an Internet connection.
fr: pour télécharger le fichier d'installation. • Exécutez le fichier téléchargé puis suivez les instructions données par l'installeur. • Une fois l'installation terminée, cliquez sur le bouton 'OK' pour continuer. • L'installation nécessite une connexion à Internet.

# installMagickLinux
source: To download the AppImage file. • In the terminal, run the following commands: chmod +x <file> sudo mv <file> /usr/local/bin • The installation requires an Internet connection.
fr: pour télécharger le fichier AppImage. • Dans le terminal faites les commandes chmod +x <fichier> sudo mv <fichier> /usr/local/bin • L'installation nécessite une connexion à Internet.

# installationError
source: An error occurred while checking {name}.
fr: Une erreur s'est produite lors de la vérification de {name}.

# installationErrorGeneric
source: Sorry, but an error has occurred. Please make sure you are connected to the Internet.
fr: Désolé mais une erreur s'est produite. Assurez-vous d'être connecté à Internet.

# installationErrorMessage
source: Check that you have followed the instructions correctly.
fr: Vérifiez que vous avez bien suivi les instructions.

# installationSuccess
source: {name} has been successfully installed.
fr: {name} a été installé avec succès.

# installing
source: Installation in progress
fr: Installation en cours

source: Keep metadata
fr: Garder les métadonnées

source: Language
fr: Langue

source: Locate
fr: Localiser

source: Locate ffmpeg
fr: Localiser ffmpeg

source: Low
fr: Faible

# magickRequired
source: ImageMagick is required to compress images.
fr: ImageMagick est requis pour compresser des images.

# magickSuccess
source: You can now compress your images.
fr: Vous pouvez maintenant compresser vos images.

source: Medium
fr: Moyenne

# newVersionAvailable
source: A new version is available !
fr: Une nouvelle version est disponible !

# noAudioTrackFound
source: No audio track found in the file for MP3 conversion.
fr: Aucune piste audio n'a été trouvée dans le fichier pour la conversion MP3.

# openExplorer
source: Open in Explorer
fr: Ouvrir dans l'explorateur

# openFinder
source: Open in Finder
fr: Ouvrir dans Finder

source: Output directory
fr: Dossier de sortie

source: Please wait
fr: Veuillez patienter

# processedFiles
source: files processed
fr: fichiers traités

source: Quality
fr: Qualité

source: Quit
fr: Quitter

# quitWarning
source: A compression/conversion process is underway, do you really want to quit?
fr: Un processus de compression/conversion est en cours, voulez-vous vraiment quitter ?

# reportError
source: Report by mail
fr: Signaler par mail

# requiredModule
source: Module required
fr: Module requis

source: Reset
fr: Réinitialiser

source: Restart
fr: Redémarrer

# restartNowQuestion
source: Do you want to restart the application to apply the changes?
fr: Souhaitez-vous redémarrer l'application pour appliquer les modifications ?

# restartRequired
source: You must restart the application for this change to take effect.
fr: Vous devez redémarrer l'application pour que cette modification prenne effet.

source: Retry
fr: Réessayer

# saved
source: economized
fr: économisés

# seeErrors
source: See the errors
fr: Voir les erreurs

source: Settings
fr: Paramètres

source: Size
fr: Taille

# toInstall
source: • To install {name}, click
fr: • Pour installer {name}, cliquez

# tooltipGhostscript
source: GhostScript lets you compress PDF files.
fr: GhostScript vous permet de compresser des fichiers PDF.

# tooltipImageMagick
source: ImageMagick lets you compress images.
fr: ImageMagick vous permet de compresser des images.

source: Unsupported file format.
fr: Format non supporté.

source: Videos
fr: Vidéos

source: Waiting
fr: En attente
